Revit 2027 API
FormatOptions.IsValidForSpec Method
 Checks whether this FormatOptions is valid for a given spec.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValidForSpec(
	ForgeTypeId specTypeId
)
Public Function IsValidForSpec (
	specTypeId As ForgeTypeId
) As Boolean
public:
bool IsValidForSpec(
	ForgeTypeId^ specTypeId
)
member IsValidForSpec :
        specTypeId : ForgeTypeId -> bool
Parameters
specTypeId ForgeTypeId
 Identifier of the spec.
Return Value
Boolean
 True if the FormatOptions is valid, false otherwise.
Exceptions
Exception | Condition
ArgumentException |  specTypeId is not a measurable spec identifier. See UnitUtils.IsMeasurableSpec(ForgeTypeId).
ArgumentNullException |  A non-optional argument was null
Remarks
 The FormatOptions is valid if UseDefault is true or if the unit in the FormatOptions is valid for the spec. See UnitUtils.IsValidUnit(ForgeTypeId, ForgeTypeId) and UnitUtils.GetValidUnits(ForgeTypeId).
See Also
Reference
FormatOptions Class
Autodesk.Revit.DB Namespace